martuan/ESP32-INTI-Electronica/firmware/src/main.cpp
}
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

void printDirectory_v3(File dir, int numTabs){

	while(true){

		int indexBeginDate = 0;
		int indexEndDate = 0;

		int indexBeginYear = 0;
		int indexEndYear = 0;

		int indexBeginMonth = 0;
		int indexEndMonth = 0;

		int indexBeginDay = 0;
		int indexEndDay = 0;

		String date = {};
		String year = {};
		String month = {};
		String day = {};
		String fechaNormalizada = {};

		
		File entry =  dir.openNextFile();

		if (! entry) {
			// no hay mas archivos
			break;
		}
		for (uint8_t i = 0; i < numTabs; i++) {
		Serial.print('\t');
		}
		
		Serial.println(entry.name());
	
		
		if (webpage.length() > 1000) {
			SendHTML_Content();
		}
		
		if(entry.isDirectory() && fechaEnsayoConsultada.length() == 0){//Si es un directorio y no hay consulta por fechas
			
			Serial.print("entry.path() = ");
			Serial.println(entry.path());

			//pathDirectory = entry.name();//obtiene el nombre del directorio
			
			//String rutaDir = pathDirectory + "/" + entry.name();

			Serial.println(String(entry.isDirectory()?"Dir ":"File ")+String(entry.name()));
		//webpage += "<tr><td>"+String(file.name())+"</td><td></td><td>"+String(file.isDirectory()?"Dir":"File")+"</td><td></td><td align='center'><input type='checkbox' id='vehicle4' name='vehicle1' value='Bike'><label for='vehicle1'> Borrar</label></td></tr>";
	//	  webpage += "<tr><td>"+pathDirectory+"</td><td></td><td>"+String(file.isDirectory()?"Dir":"File")+"</td><td></td><td align='center'><input type='checkbox' id='vehicle4' name='vehicle1' value='Bike'><label for='vehicle1'> Borrar</label></td></tr>";
			webpage += "<tr><td>"+String(entry.path())+"</td><td></td><td>"+String(entry.isDirectory()?"Dir":"File")+"</td><td></td><td align='center'><input type='checkbox' id='vehicle4' name='vehicle1' value='Bike'><label for='vehicle1'> Borrar</label></td></tr>";
		
			//Serial.println("/");
			printDirectory_v3(entry, numTabs + 1);
		}
		else//Si es un archivo
		{
		//Serial.print(String(file.name())+"\t");
			
			filename = String(entry.name());//convierte a String
			String rutaArchivo = String(entry.path());


			if(filename.length() == 19 && filename.charAt(8) == 'T'){//si el archivo es una fecha de ensayo

				//********FECHA******
				indexBeginDate = 0;
				indexEndDate =	filename.indexOf('T');

				date = filename.substring(indexBeginDate,indexEndDate);//obtiene la fecha del ensayo
				//Serial.println("Fecha: ");
				//Serial.println(date);

				//********AÑO******
				indexBeginYear = 0;
				indexEndYear =	3;

				year = filename.substring(indexBeginYear,indexEndYear + 1);//obtiene el año del ensayo
				//Serial.println("Año: ");
				//Serial.println(year);

				//********MES******
				indexBeginMonth = 4;
				indexEndMonth =	5;

				month = filename.substring(indexBeginMonth,indexEndMonth + 1);//obtiene el mes del ensayo
				//Serial.println("Mes: ");
				//Serial.println(month);

				//********DIA******
				indexBeginDay = 6;
				indexEndDay =	7;

				day = filename.substring(indexBeginDay,indexEndDay + 1);//obtiene el día del ensayo
				//Serial.println("Día: ");
				//Serial.println(day);

				fechaNormalizada = year + "-" + month + "-" + day;
				//Serial.println(fechaNormalizada);

			}else{
				fechaNormalizada = "";
			}
			
			//si fechaEnsayoConsultada coincide con fechaNormaliza, arma la tabla con las filas correspondientes
			//aplica filtro
			if(fechaEnsayoConsultada.length() > 0){//si se ha realizado consultaPorFecha
			
				Serial.print("-------------------------> ");
				Serial.print("SI se ha realizado consultaPorFecha");
				Serial.println(" <------------------------ ");
				
				//String rutaArchivo = pathDirectory + "/" + entry.name();
				if(fechaNormalizada.compareTo(fechaEnsayoConsultada) == 0){//si coinciden las fechas

					Serial.println("SI coinciden las fechas");
				
					//webpage += "<tr><td>"+filename+"</td><td>"+fechaNormalizada+"</td>";
					webpage += "<tr><td>"+ rutaArchivo +"</td><td>"+fechaNormalizada+"</td>";
					Serial.print(String(entry.isDirectory()?"Dir ":"File ")+String(entry.name())+"\t");
					webpage += "<td>"+String(entry.isDirectory()?"Dir":"File")+"</td>";
					int bytes = entry.size();
					String fsize = "";
					
					if (bytes < 1024)                     fsize = String(bytes)+" B";
					else if(bytes < (1024 * 1024))        fsize = String(bytes/1024.0,3)+" KB";
					else if(bytes < (1024 * 1024 * 1024)) fsize = String(bytes/1024.0/1024.0,3)+" MB";
					else                                  fsize = String(bytes/1024.0/1024.0/1024.0,3)+" GB";
					//webpage += "<td>"+fsize+"</td><td align='center'><input type='checkbox' id='vehicle4' name='vehicle1' value='Bike'><label for='vehicle1'> Borrar</label></td>";
					webpage += "<td>"+fsize+"</td><td><form action='/delete' method='post'><input type='text' hidden name='lname' value='"+String(rutaArchivo)+"'><input type='submit' name='delete' value='Borrar'></form></td>";
					//webpage += "<td align='left'><a href='download'><button class='btn'><i class='fa fa-download'></i>Download</button></a></td></tr>";
					//webpage += "<td align='left'><a href='/"+filename+"' download>Download</a></td></tr>";
					//webpage += "<td><form action='/download' method='post'><input type='text' hidden name='lname' value='"+String(entry.name())+"'><input type='submit' name='download' value='Descargar'></form></td>";
					Serial.print("Archivo a descargar = ");
					Serial.print(rutaArchivo);
					webpage += "<td><form action='/download' method='post'><input type='text' hidden name='lname' value='"+String(rutaArchivo)+"'><input type='submit' name='download' value='Descargar'></form></td>";
					Serial.println(String(fsize));
				}else{//si no coinciden las fechas
					//webpage += "<p>La fecha consultada no muestra datos</p><br>";
					Serial.println("NO coinciden las fechas");
				}
			
			
			}else{//si no se ha realizado consultaPorFecha, se muestra todo sin filtro
				
				
				Serial.print("-------------------------> ");
				Serial.print("NO se ha realizado consultaPorFecha");
				Serial.println(" <------------------------ ");

				//webpage += "<tr><td>"+filename+"</td><td>"+fechaNormalizada+"</td>";
				webpage += "<tr><td>"+rutaArchivo+"</td><td>"+fechaNormalizada+"</td>";
				Serial.print(String(entry.isDirectory()?"Dir ":"File ")+String(entry.name())+"\t");
				webpage += "<td>"+String(entry.isDirectory()?"Dir":"File")+"</td>";
				int bytes = entry.size();
				String fsize = "";
				
				if (bytes < 1024)                     fsize = String(bytes)+" B";
				else if(bytes < (1024 * 1024))        fsize = String(bytes/1024.0,3)+" KB";
				else if(bytes < (1024 * 1024 * 1024)) fsize = String(bytes/1024.0/1024.0,3)+" MB";
				else                                  fsize = String(bytes/1024.0/1024.0/1024.0,3)+" GB";
				//webpage += "<td>"+fsize+"</td><td align='center'><input type='checkbox' id='vehicle4' name='vehicle1' value='Bike'><label for='vehicle1'> Borrar</label></td>";
				webpage += "<td>"+fsize+"</td><td><form action='/delete' method='post'><input type='text' hidden name='lname' value='"+String(rutaArchivo)+"'><input type='submit' name='delete' value='Borrar'></form></td>";
				//webpage += "<td align='left'><a href='download'><button class='btn'><i class='fa fa-download'></i>Download</button></a></td></tr>";
				//webpage += "<td align='left'><a href='/"+filename+"' download>Download</a></td></tr>";
				Serial.print("Archivo a descargar = ");
				Serial.println(rutaArchivo);
				webpage += "<td><form action='/download' method='post'><input type='text' hidden name='lname' value='"+String(rutaArchivo)+"'><input type='submit' name='download' value='Descargar'></form></td>";
				Serial.println(String(fsize));

